Data Exploration And loading (cleaning, Transforming, Removing duplicates and null values etc)

In [10]:
# Importing Dependencies
 
import pandas as pd 

# PostgreSQL connection


import psycopg2    # it will help to connect python with postgreSQL database and work as a adapter
from sqlalchemy import create_engine

In [11]:
df = pd.read_csv("Walmart.csv", encoding_errors='ignore')

df.shape

(10051, 11)

In [12]:
# let's check the first 5 rows of our dataset

df.head(5)

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [15]:
# getting a little more information about our dataset.

df.describe()
#this feature helps us to get description to get the aggregations like count,mean,standard deviation, min, max count etc.

df.info()
# this info() help us to identify null columns if exist, datatypes and memory usage 

# converting all column names to lowercase

df.columns = df.columns.str.lower()

# ChecK 
df.head(3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   branch          10051 non-null  object
 2   city            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  object
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 863.9+ KB

,invoice_id,branch,city,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33

In [19]:
df.isnull().sum()

# as we can see there are two columns unit_price and quantity that have 31 nulls each as shown in the output below 

# we will deal with this after removing the duplicates from the dataset

invoice_id         0
branch             0
city               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

In [20]:
# now we are going to check foe duplicated records for this we use a function 

df.duplicated().sum()

# as the output shows we have 51 duplicates

np.int64(51)

In [21]:
# now as we got  the duplicates in the previous cell we are going to remove those duplicates.

df.drop_duplicates(inplace= True)  # all the duplicates are  removed from the dataframe when i execute it.

# now let's verify or see if the duplicates are removed from the dataframe
df.duplicated().sum()

# so as you can see the output is 0 which means that all duplicates are removed from the dataframe

np.int64(0)

In [40]:
# now we are going to drop all the null values from the dataset
# for this we use :

df.dropna(inplace= True)   # all the null values are removed from the dataset


# let's verify if the null values are removed from the dataset
df.isnull().sum()

invoice_id        0
Branch            0
City              0
category          0
unit_price        0
quantity          0
date              0
time              0
payment_method    0
rating            0
profit_margin     0
dtype: int64

In [22]:
# now let's also see the data types of different columns to see if they are correct 
df.dtypes

# as we can see the unit_price column is in object datatype we need to convert it into 
# float datatype for this we will remove the $ sign from the column and then convert it into float datatype

df['unit_price'] = pd.to_numeric(df['unit_price'].astype(str).str.replace('$', '', regex=False),
errors='coerce')






# # let's verify if the changes are done
# df.dtypes

# # so now we can clearly see that the unit_price column is now in float datatype.
# df['unit_price'].head(5)

In [ ]:

#  Creating a new column "Total_Price"

df['Total_Price'] = df['unit_price'] * df['quantity']   

df.head(5)

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,Total_Price
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48,76.40
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48,604.17

The cleaning and transformation is done.Let's export the data to SQL now.

In [23]:
# # exporting the cleaned data to a new csv file
df.to_csv("walmart_cleaned_data.csv", index=False)

In [ ]:
# Now to export this cleaned data to my PostGre SQL database i will need a few things :

# 1. Host = localhost
# 2. DataBase name = Walmart_DB
# 3. User = postgRes 
# 5. Port = 5432
# 4. Password = "_____"

In [24]:
# Postgres cConnection 

engine_psql = create_engine('postgresql+psycopg2://postgres:vai272727@localhost:5432/walmart_db')  

try:
    engine_psql
    print("Connection to PostgreSQL database established successfully.")

except:
    print("Connection to PostgreSQL database failed.")

Connection to PostgreSQL database established successfully.

In [25]:
# df.to_sql(name = 'Walmart', con=engine_psql, if_exists='append', index=False)

df.to_sql(name = 'walmart', con= engine_psql, if_exists='append', index=False)

1000